{
  "allow_encoder_teacher_forcing": false,
  "apply_decay": false,
  "apply_decoder_heads": true,
  "apply_ffn": true,
  "apply_hidden_pos_offset": true,
  "apply_softmax_gate": true,
  "architectures": [
    "COINForConditionalGeneration"
  ],
  "block_io_schema": null,
  "cross_encoder_schema": [
    0,
    0
  ],
  "decoder_output": "none",
  "decoder_schema": [
    1,
    1
  ],
  "decoder_start_token_id": 0,
  "disable_teacher_forcing": false,
  "experts_schema": null,
  "ffn_intermediate_factor": 4,
  "ffn_intermediate_size": 4096,
  "fixed_decay_value": null,
  "fixed_ffn_intermediate_size": false,
  "fixed_intermediate_size": false,
  "forward_method": "chunkwise",
  "global_recurrence_check": false,
  "group_norm_channels": 1024,
  "group_norm_num": 32,
  "hidden_act": "tanh",
  "hidden_dropout_prob": 0.1,
  "hidden_out_act": "relu",
  "hidden_retention_act": "relu",
  "hidden_size": 1024,
  "initializer_range": 0.02,
  "intermediate_factor": 1,
  "intermediate_size": 1024,
  "layer_norm_eps": 1e-12,
  "local_recurrence_check": false,
  "max_position_embeddings": 512,
  "model_type": "Consecutive Chain-Of-Input Network",
  "num_decay_parts": 1,
  "num_global_chunks": 4,
  "num_heads": 32,
  "num_hidden_layers": 2,
  "num_local_chunks": 4,
  "num_regions": 2,
  "num_repetitions": 1,
  "pad_token_id": 0,
  "reset_S_n_state": false,
  "retention_group_norm_eps": 1e-05,
  "reverse_decay": false,
  "revert_decoder": false,
  "rms_norm_eps": 1e-08,
  "rope_dim": 16,
  "share_S": false,
  "switch_ii_decoder_ii": false,
  "torch_dtype": "float32",
  "transformers_version": "4.40.1",
  "vocab_size": 30522
}
