{
  "apply_attention_mask": false,
  "apply_decay_mask": true,
  "architectures": [
    "COINForCausalLM"
  ],
  "gamma": 0.999999,
  "group_norm_channels": 32,
  "group_norm_eps": 1e-05,
  "group_norm_num": 32,
  "hidden_dropout_prob": 0.1,
  "hidden_size": 1024,
  "inference_chunk_size": null,
  "initializer_range": 0.02,
  "input_size": 1024,
  "intermediate_size": 1536,
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "ci4",
  "num_layers": 4,
  "pad_token_id": 0,
  "qkv_activation": "relu",
  "reset_hidden_states": true,
  "rms_norm_eps": 1e-06,
  "rope_dim": 16,
  "torch_dtype": "float32",
  "training_chunk_size": null,
  "transformers_version": "4.40.1",
  "vocab_size": 50257
}
