{
  "allow_encoder_teacher_forcing": false,
  "apply_decay": true,
  "apply_decoder_heads": true,
  "apply_ffn": true,
  "apply_hidden_pos_offset": false,
  "apply_softmax_gate": true,
  "architectures": [
    "COINForSequenceClassification"
  ],
  "block_io_schema": null,
  "cross_encoder_schema": [
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0
  ],
  "decoder_output": "adaptive",
  "decoder_schema": [
    1,
    1,
    1,
    1,
    1,
    1,
    1,
    1
  ],
  "decoder_start_token_id": 0,
  "disable_teacher_forcing": false,
  "experts_schema": null,
  "ffn_intermediate_factor": 4,
  "ffn_intermediate_size": 4096,
  "fixed_decay_value": null,
  "fixed_ffn_intermediate_size": false,
  "fixed_intermediate_size": false,
  "forward_method": "parallel",
  "global_recurrence_check": false,
  "group_norm_channels": 1024,
  "group_norm_num": 32,
  "hidden_act": "tanh",
  "hidden_dropout_prob": 0.1,
  "hidden_out_act": "relu",
  "hidden_pos_offset": false,
  "hidden_retention_act": "relu",
  "hidden_size": 1024,
  "id2label": {
    "0": "LABEL_0",
    "1": "LABEL_1",
    "2": "LABEL_2",
    "3": "LABEL_3",
    "4": "LABEL_4",
    "5": "LABEL_5",
    "6": "LABEL_6",
    "7": "LABEL_7",
    "8": "LABEL_8",
    "9": "LABEL_9",
    "10": "LABEL_10",
    "11": "LABEL_11",
    "12": "LABEL_12",
    "13": "LABEL_13",
    "14": "LABEL_14",
    "15": "LABEL_15",
    "16": "LABEL_16",
    "17": "LABEL_17",
    "18": "LABEL_18",
    "19": "LABEL_19",
    "20": "LABEL_20",
    "21": "LABEL_21",
    "22": "LABEL_22",
    "23": "LABEL_23",
    "24": "LABEL_24",
    "25": "LABEL_25",
    "26": "LABEL_26",
    "27": "LABEL_27",
    "28": "LABEL_28",
    "29": "LABEL_29"
  },
  "initializer_range": 0.02,
  "intermediate_factor": 1,
  "intermediate_size": 1024,
  "label2id": {
    "LABEL_0": 0,
    "LABEL_1": 1,
    "LABEL_10": 10,
    "LABEL_11": 11,
    "LABEL_12": 12,
    "LABEL_13": 13,
    "LABEL_14": 14,
    "LABEL_15": 15,
    "LABEL_16": 16,
    "LABEL_17": 17,
    "LABEL_18": 18,
    "LABEL_19": 19,
    "LABEL_2": 2,
    "LABEL_20": 20,
    "LABEL_21": 21,
    "LABEL_22": 22,
    "LABEL_23": 23,
    "LABEL_24": 24,
    "LABEL_25": 25,
    "LABEL_26": 26,
    "LABEL_27": 27,
    "LABEL_28": 28,
    "LABEL_29": 29,
    "LABEL_3": 3,
    "LABEL_4": 4,
    "LABEL_5": 5,
    "LABEL_6": 6,
    "LABEL_7": 7,
    "LABEL_8": 8,
    "LABEL_9": 9
  },
  "layer_norm_eps": 1e-12,
  "local_recurrence_check": false,
  "max_position_embeddings": 512,
  "model_type": "Consecutive Chain-Of-Input Network",
  "num_decay_parts": 1,
  "num_global_chunks": 4,
  "num_heads": 32,
  "num_hidden_layers": 2,
  "num_local_chunks": 4,
  "num_query_heads": 1,
  "num_regions": 2,
  "num_repetitions": 1,
  "pad_token_id": 0,
  "reset_S_n_state": false,
  "retention_group_norm_eps": 1e-05,
  "reverse_decay": false,
  "revert_decoder": false,
  "rms_norm_eps": 1e-08,
  "rope_dim": 32,
  "share_S": false,
  "switch_ii_decoder_ii": false,
  "torch_dtype": "float32",
  "transformers_version": "4.40.1",
  "vocab_size": 30522
}
